# Supervised Machine Learning
- classification
- regression

- note: when you have district values, you will build classification while if the target is continuous, build regression
- use (70 to 80%) of data to train the machine while you use about (20 to 30%) for testing the model

In [19]:
import numpy as np
import pandas as pd 
from sklearn.model_selection import train_test_split

In [6]:
path = "C:/Users/KENNETH/Documents/LASOP DATA SCIENCE/Machine Learning/data/"
Startups = pd.read_csv(path + "50_Startups.csv")
Startups.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

# Classification

In [ ]:
# for classification, data with district values (As target) are used such as (0,1, "yes or no", "true or false")
while for regression, use data with continuous values (As target)

In [10]:
path = "C:/Users/KENNETH/Documents/LASOP DATA SCIENCE/Machine Learning/data/"

Social_Network = pd.read_csv(path + "Social_Network_Ads.csv")
Social_Network.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

# Step one

In [13]:
# separate the feature from the target
X = Social_Network.drop(columns=["User ID"]) # feature
y = X.pop("Purchased")  # target

In [ ]:
 # note: you can drop more than one column by using a comma i.e X = Social_Network.drop(columns=["User ID"],["Gender"])

In [14]:
X

     Gender  Age  EstimatedSalary
0      Male   19            19000
1      Male   35            20000
2    Female   26            43000
3    Female   27            57000
4      Male   19            76000
..      ...  ...              ...
395  Female   46            41000
396    Male   51            23000
397  Female   50            20000
398    Male   36            33000
399  Female   49            36000

[400 rows x 3 columns]

In [15]:
y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

# Step two (If necessary)

In [ ]:
# transformation (machine learning does not understand text variable)

# nominal variable (does not have ranking)
# ordinal variable (it has a sense of ranking like ["good, better, best"])

In [ ]:
# Eg good better best
 transformed as;    
    
    
    good     1
    better   2
    best     3

In [ ]:
# For nominal variable
State
Lagos
Oyo
Ondo


TRansform as

State_lagos     state_oyo      state_ondo
1                 0               0
0                 1               0

0                 0               1

In [17]:
# transformation
# transforming the gender column

pd.get_dummies(X, columns=["Gender"]) # then save it back to X
X=pd.get_dummies(X, columns=["Gender"])

In [18]:
X

     Age  EstimatedSalary  Gender_Female  Gender_Male
0     19            19000              0            1
1     35            20000              0            1
2     26            43000              1            0
3     27            57000              1            0
4     19            76000              0            1
..   ...              ...            ...          ...
395   46            41000              1            0
396   51            23000              0            1
397   50            20000              1            0
398   36            33000              0            1
399   49            36000              1            0

[400 rows x 4 columns]

# Step three

In [21]:
# Split the data into train and validation
x_train,x_val,y_train, y_val = train_test_split(X, y, test_size = 0.1, random_state = 42)

# Step Four

In [22]:
# build the model
from sklearn.tree import DecisionTreeClassifier # import algorithm

dt = DecisionTreeClassifier() # create the instance of the algoreithm

model = dt.fit(x_train,y_train)

In [23]:
# build model two
from sklearn.linear_model import LogisticRegression

lr =  LogisticRegression()
model2 = lr.fit(x_train,y_train)

# Step Five